# ValueOutOfRange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..ValueOutOfRange Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Value is out of range ! Please enter a number between [Value] and [Value].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ValueOutOfRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ValueOutOfRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ValueOutOfRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace